In [ ]:
# SETUP CODE - PlEASE RUN THIS ONCE WHEN YOU STARTUP YOUR CODESPACE

# RUN TEST FILE
%run 'test/week4_test.ipynb'

# Week 4 - Data Cleaning and Data Manipulation

## Introduction

In this notebook, we will explore common techniques for data cleaning and manipulation using the Pandas library in Python. Proper data preparation is crucial for accurate analysis and modeling. </br>

Below is a data cleaning checklist which contains some useful tips on what to keep an eye out for. </br>

<img src = https://images.datacamp.com/image/upload/v1654855433/Data_Cleaning_Checklist_1x_fad5f3e982.png width = "900" height = "2500" >

We are now going to look at how to implement some of these techniques in code. Some other data cleaning techniques will be touched on in next week's notebook.

### Import Libraries

Let's start by importing the necessary libraries.

In [2]:
import pandas as pd

## Data Cleaning

### Handling Missing Values
Handling missing values is a critical step in the data cleaning process. Let's create a sample DataFrame with missing values to demonstrate the techniques.

In [3]:
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
        'Age': [25, 30, None, 22, 35],
        'Salary': [50000, 60000, 75000, None, 80000]}

df = pd.DataFrame(data)
df

      Name   Age   Salary
0    Alice  25.0  50000.0
1      Bob  30.0  60000.0
2  Charlie   NaN  75000.0
3    David  22.0      NaN
4      Eva  35.0  80000.0

Check for Missing Values </br></br>
We can use the isnull() function to identify missing values in the DataFrame.

In [4]:
# Check for missing values
missing_vals = df.isnull()
print(missing_vals)

    Name    Age  Salary
0  False  False   False
1  False  False   False
2  False   True   False
3  False  False    True
4  False  False   False

In [5]:
# Check for missing values
missing_vals_total = df.isnull().sum()
print(missing_vals_total)

Name      0
Age       1
Salary    1
dtype: int64

Fill Missing Values

Filling missing values is a common strategy. Situational logical should be applied to choose how best to fill in the missing values, and it also depends on the datatype of the column. 
- If you're looking at a numerical column, you may like to use the mean value, maximum value or minimum value of that column, or alternatively fill the missing values with a 0.
- If it is a string column, you may like to fill it with the string 'missing', depending on your use case and/or personal preference.

In this example, as we are looking at missing values in numerical columns, we will firstly fill the missing values with a specific value (0), then we will show you how to fill the missing values with the mean of each column.

In [6]:
# Fill missing values with 0
df['Age'].fillna(0, inplace=True)
df['Salary'].fillna(0, inplace=True)
df

      Name   Age   Salary
0    Alice  25.0  50000.0
1      Bob  30.0  60000.0
2  Charlie   0.0  75000.0
3    David  22.0      0.0
4      Eva  35.0  80000.0

In [7]:
# Fill missing values with mean
df['Age'].fillna(df['Age'].mean(), inplace=True)
df['Salary'].fillna(df['Salary'].mean(), inplace=True)
df

      Name   Age   Salary
0    Alice  25.0  50000.0
1      Bob  30.0  60000.0
2  Charlie   0.0  75000.0
3    David  22.0      0.0
4      Eva  35.0  80000.0

Did you notice how no values changed to the mean (remained as 0)? This is because when we filled the missing values with 0, we used the "inplace" attribute which essentially means the dataframe 'df' was overridden and those values were now saved in place of the missing values, resulting in 'df' not having any missing values. 

Be mindful when using the inplace attribute, because if you use it in error, you may need to re-run your previous code to get back to the dataframe format/contents you wish to use. An alternative in some cases would be to create a new dataframe.

In our case, it would be better to use the column means to fill in the missing values (instead of 0), and we will save the new dataframe as a different dataframe variable.

In [8]:
df = pd.DataFrame(data)
df

      Name   Age   Salary
0    Alice  25.0  50000.0
1      Bob  30.0  60000.0
2  Charlie   NaN  75000.0
3    David  22.0      NaN
4      Eva  35.0  80000.0

In [9]:
# Fill missing values with mean
df2 = df.copy()
df2['Age'].fillna(df2['Age'].mean(), inplace=True)
df2['Salary'].fillna(df2['Salary'].mean(), inplace=True)
df2

      Name   Age   Salary
0    Alice  25.0  50000.0
1      Bob  30.0  60000.0
2  Charlie  28.0  75000.0
3    David  22.0  66250.0
4      Eva  35.0  80000.0

An alternative to filling missing or null values is to remove the whole row of data. As we didn't override the original dataframe 'df', we will now remove the rows which contain missing values

In [10]:
df.dropna()

    Name   Age   Salary
0  Alice  25.0  50000.0
1    Bob  30.0  60000.0
4    Eva  35.0  80000.0

The documentation for this function can be found in the link below, which contains explanations of it's various parameters. A common parameter to use is the 'subset' argument, which will only drop a row if there is a missing value in the specified column, and will keep rows which have missing values in other columns

https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.dropna.html

This is how you would drop rows with missing values in just the salary column:

In [11]:
df.dropna(subset=['Salary'])

      Name   Age   Salary
0    Alice  25.0  50000.0
1      Bob  30.0  60000.0
2  Charlie   NaN  75000.0
4      Eva  35.0  80000.0

### Removing Duplicates
Duplicate records can skew analysis results. Let's create a DataFrame with duplicates and demonstrate how to handle them.

In [12]:
data_duplicates = {'ID': [1, 2, 3, 4, 1],
                   'Product': ['A', 'B', 'C', 'D', 'A'],
                   'Quantity': [10, 20, 15, 30, 10]}

df_duplicates = pd.DataFrame(data_duplicates)
df_duplicates

   ID Product  Quantity
0   1       A        10
1   2       B        20
2   3       C        15
3   4       D        30
4   1       A        10

Check and Remove Duplicates.

Checking and removing duplicates is essential for maintaining data integrity.

In [13]:
# Check for duplicates
print("Duplicates before removal: \n",df_duplicates.duplicated())

# Remove duplicates
df_duplicates.drop_duplicates(inplace=True)
print("\nDataFrame after removing duplicates: \n", df_duplicates)

Duplicates before removal:
 0    False
1    False
2    False
3    False
4     True
dtype: bool

DataFrame after removing duplicates:
    ID Product  Quantity
0   1       A        10
1   2       B        20
2   3       C        15
3   4       D        30

### Challenge task 1: Data cleaning example

You have been given some fake data below that contains information about employees at a random company. Your task is to perform the following data cleaning steps:

- Identify and handle missing values in the dataset. Think about the best way to do this
- Remove any duplicate records from the dataset.
- Display the cleaned DataFrame.

The goal is to apply the data cleaning techniques learned in the notebook to ensure the dataset is ready for further analysis.

In [15]:
# First 5 rows of the dataframe for challenge 1. Make sure you have run the first command of this notebook for this to work

challenge_1_df.head()

NameError: name 'challenge_1_df' is not defined

In [ ]:
# Fill out your answer below

## Data Manipulation

There are various ways you can manipulate data, including selecting specific rows & columns, filtering, grouping, aggregating, pivotting, sorting, changing data types, & joining dataframes together. All of these techniques were covered in the week 3 material, except for the last 3, which will be covered now.

### Sorting data

Sorting data is crucial for better visualization and analysis. Let's demonstrate how to sort a DataFrame, using df2 (the original dataframe with the missing values filled in by the column mean).

In [16]:
df2

      Name   Age   Salary
0    Alice  25.0  50000.0
1      Bob  30.0  60000.0
2  Charlie  28.0  75000.0
3    David  22.0  66250.0
4      Eva  35.0  80000.0

In [17]:
# Sort by single column
# Sort DataFrame by 'Age' in descending order
df2_sorted_age = df2.sort_values(by='Age', ascending=False)
df2_sorted_age

      Name   Age   Salary
4      Eva  35.0  80000.0
1      Bob  30.0  60000.0
2  Charlie  28.0  75000.0
0    Alice  25.0  50000.0
3    David  22.0  66250.0

In [18]:
# Sort by multiple columns - but first, add in some extra data!
new_data = {'Name': ['Frank', 'George', 'Hayley'],
            'Age': [25, 30, 22],
            'Salary': [60000, 75000, 65000]}
new_df = pd.DataFrame(new_data)
new_df

     Name  Age  Salary
0   Frank   25   60000
1  George   30   75000
2  Hayley   22   65000

In [19]:

df2_new = pd.concat([df2, new_df], ignore_index = True) 
df2_new

      Name   Age   Salary
0    Alice  25.0  50000.0
1      Bob  30.0  60000.0
2  Charlie  28.0  75000.0
3    David  22.0  66250.0
4      Eva  35.0  80000.0
5    Frank  25.0  60000.0
6   George  30.0  75000.0
7   Hayley  22.0  65000.0

In [20]:
# Sort DataFrame by 'Age' in ascending order and then by 'Salary' in descending order
df2_sorted_multiple = df2_new.sort_values(by=['Age', 'Salary'], ascending=[True, False])
df2_sorted_multiple

      Name   Age   Salary
3    David  22.0  66250.0
7   Hayley  22.0  65000.0
5    Frank  25.0  60000.0
0    Alice  25.0  50000.0
2  Charlie  28.0  75000.0
6   George  30.0  75000.0
1      Bob  30.0  60000.0
4      Eva  35.0  80000.0

### Changing Data Types

Changing data types is important when the default types assigned by Pandas may not be suitable for analysis.

In [21]:
df2_sorted_multiple.dtypes

Name       object
Age       float64
Salary    float64
dtype: object

In [22]:
# Change the data type of the 'Age' column to float
df2_sorted_multiple['Age'] = df2_sorted_multiple['Age'].astype(int)
print(df2_sorted_multiple.dtypes)

Name       object
Age         int64
Salary    float64
dtype: object

In [23]:
# Convert data types of multiple columns
df2_new = df2_new.astype({'Age': 'int', 'Salary': 'float'}) #note, salary was already float (this is just an example)
print(df2_new.dtypes)

Name       object
Age         int64
Salary    float64
dtype: object

### Joining Datasets

Joining datasets is a common operation when combining information from different sources. It is important to keep in mind which type of join you are doing (for example: inner, outer, left, right). Below is a visualisation of a few different types of joins

<img src = https://miro.medium.com/v2/resize:fit:900/1*yb76Gk03pZsjVDp79n2yKA.jpeg width = "400" height = "250" >

In [24]:
# Create two sample DataFrames
df1_join_eg = pd.DataFrame({'ID': [1, 2, 3], 'Name': ['Alice', 'Bob', 'Charlie']})
df1_join_eg

   ID     Name
0   1    Alice
1   2      Bob
2   3  Charlie

In [25]:
df2_join_eg = pd.DataFrame({'ID': [2, 3, 4], 'Salary': [60000, 75000, 90000]})
df2_join_eg

   ID  Salary
0   2   60000
1   3   75000
2   4   90000

In [26]:
# Merge DataFrames based on 'ID', using 'inner' method
merged_df_inner = pd.merge(df1_join_eg, df2_join_eg, on='ID', how='inner')
merged_df_inner

   ID     Name  Salary
0   2      Bob   60000
1   3  Charlie   75000

In [27]:
# Merge DataFrames based on 'ID', using 'outer' method
merged_df_outer = pd.merge(df1_join_eg, df2_join_eg, on='ID', how='outer')
merged_df_outer

   ID     Name   Salary
0   1    Alice      NaN
1   2      Bob  60000.0
2   3  Charlie  75000.0
3   4      NaN  90000.0

In [28]:
# Merge DataFrames based on 'ID', using 'left' method
merged_df_left = pd.merge(df1_join_eg, df2_join_eg, on='ID', how='left')
merged_df_left

   ID     Name   Salary
0   1    Alice      NaN
1   2      Bob  60000.0
2   3  Charlie  75000.0

In [29]:
# Merge DataFrames based on 'ID', using 'right' method
merged_df_right= pd.merge(df1_join_eg, df2_join_eg, on='ID', how='right')
merged_df_right

   ID     Name  Salary
0   2      Bob   60000
1   3  Charlie   75000
2   4      NaN   90000

You can also join on multiple attributes (columns). In the above example, you would not merge on multiple columns as both df1_join_eg & df2_join_eg only have 1 column in common. For more information about joining on multiple columns, check out this website: https://sparkbyexamples.com/pandas/pandas-merge-two-dataframes-on-multiple-columns/

### Challenge Task 2: Data manipilation example

You have two datasets provided below. Your task is to perform the following data manipulation steps:

- Apply the following operations on each DataFrame:
  1. Select only columns which are relevant to an employee database.
  2. Address the missing values in the way you see most logical
  3. Join the two DataFrames using both the left join and inner join methods based on the 'ID' column (2 new dataframes will be created).
  4. Ensure the datatypes for each column are logically correct.
  5. Sort the DataFrame based on the 'Salary' column in descending order.
- Display the final result of both joined DataFrames.

In [30]:
# First 5 rows of the dataframe 1 for challenge 2. Make sure you have run the first command of this notebook for this to work

challenge_2_df_1.head()

NameError: name 'challenge_2_df_1' is not defined

In [ ]:
# First 5 rows of the dataframe 2 for challenge 2. Make sure you have run the first command of this notebook for this to work

challenge_2_df_2.head()

In [ ]:
# Fill out your answer below